class DataAdhiya {
  String name;
  List<String> verses;
  String audio;

  DataAdhiya({
  required this.name,
  required this.verses,
  required this.audio,

});
}

var DataAdhiyaList = [
  DataAdhiya(
    name: "Tawasul",
    verses: [
      "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ",
      "Dengan Menyebut nama allah yang maha pengasih dan maha penyayang",
      "لِسَيَّدِمُحَمّدٍ سَيَّدِالْاَنَامِ وَ لِسَا ئِرْ إِ خْوَانِهِ الْاَنْبِيَا ءِ وَالْمُرْسَلِيْنَ وَأٰلِہِمْ وَاَصْحَابِہِمُ الْکِرَامِ اَجْمَءِيْنَ ",
      "لِصَا حِبِ اْلحِذْبِ مَوْ لاَنَااَبِےالْمَدَارِسِ وَالْمَسَاجِدِمُؤَسَّسِ نَهْےضَةِالْوَطَنِ اَلشَّيْخِ مُحَمَّدَذَيْنِ الدَّيْنِ بْنِ عَبْدِالْمَجِيْدِاَلْفَنْشَوْرِيَّ وَلأُصُوْلِهِ وَفُرُوْعِهِ وَلِمُحِبَّيْهِ",
      "لِجَمِيْعِ الْعُلَمَءِالْعَامِلِيْنَ وَالْأَوْلِيَاءِالْعَارِفِيْنَ وَلِوَالِدِيْنَاوَلِمَشَايِحِنَ وَلِلنَّهْضِيَّيْنَ وَالنَّهْضِيَّاتِ وَلِجَمِيْعِ الْمُسْلِمَاتِ",

    ],
    audio: 'audio/Tawasul_1.mp3'
    ),
    DataAdhiya(
    name: "Ya Rabbi Shalli",
    verses: [
      "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ",
      "يَارَبَّ صَلَّ عَلَی مُحَمَّدْحَبِيْبِكَ الشَّافِعِ الْمُشَفَّعْ",
      "يَارَبَّ صَلَّ عَلَی مُحَمَّدْأَعْلَی الْوَرَی رُتْبَةًوَأَرْفَعْ",
      "يَارَبَّ صَلَّ عَلَی مُحَمَّدْأَسْمَى الْبَرَايَاجَاهًاوَأَوْسَعْ",
      "يَارَبَّ صَلَّ عَلَی مُحَمَّدْوَاسْلُكْ بِنَارَبَّ خَيْرَمَهْيَعْ",
      "يَارَبَّ صَلَّ عَلَی مُحَمَّدْوَعَافِنَاوَاشْفِ كُلَّ مُوْجَعْ",
      "يَارَبَّ صَلَّ عَلَی مُحَمَّدْوَأَصْلِحِ الْقَلْبَ وَاعْفُ وَانْفُعْ",
      "يَارَبَّ صَلَّ عَلَی مُحَمَّدْوَاكْفِ الْمَعَادِيْ وَاصْرِفْهُ وَارْدَعْ",
      "يَارَبَّ صَلَّ عَلَی مُحَمَّدْنَحُلُّ فِی حِصْنِكَ الْمُمَنَّعْ",
      "يَارَبَّ صَلَّ عَلَی مُحَمَّدْرَبَّ ارْضَ عَنَّارِضَاكَ الاَرْفَعْ",
      "يَارَبَّ صَلَّ عَلَی مُحَمَّدْوَاجْعَلْ لَنَ فِی الْجِنَانِ مَجْمَعْ",
      "يَارَبَّ صَلَّ عَلَی مُحَمَّدْرَافِقْ بِنَاخَيْرَخَلْقِكَ أَجْمَعْ",
      "يَارَبَّ صَلَّ عَلَی مُحَمَّدْيَارَبَّ صَلَّ عَلَيْهِ وَسَلَّمْ",
      "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ وَعَلَی آلِهِ",

    ],
    audio: 'audio/ya_rabb_shalli_2.mp3'
    ),
    DataAdhiya(
    name: "Assalamu'alaik",
    verses: [
      "السَّلاَمُ عَلَيْكَ زَيْنَ الأَنْبِيَاءِ",
      "السَّلاَمُ عَلَيْكَ أَتْقَی الأَتْقِيَاءِ",
      "السَّلاَمُ عَلَيْكَ يَانُوْرَالظَّلاَمِ",
      "السَّلاَمُ عَلَيْكَ أَصْفَی الأَصْفِيَاءِ",
      "السَّلاَ مُ عَلَيْكَ طٰهَ يَاطَبيْبِيْ",
      "السَّلاَ مُ عَلٰی الْمُشَفَّعِ فِی الْقِيَا مَةِ",
      "السَّلاَ مُ عَلٰی الْمُظَلَّلِ بِا لْغَمَا مَةِ",
      "السَّلاَ مُ عَلٰی الْمُشَفَّعِ فِی الْقِيَامَةِ",
      "السَّلاَ مُ عَلٰی الْمُتَوَّجِ بِا لْكَرَامَةِ",
      "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ وَعَلَی آلِهِ",

    ],
    audio: "audio/assalamualaik_3.mp3"
    ),
    DataAdhiya(
    name: "Inna Fatahna",
    verses: [
      "أَعُوْذُبِاللّٰهِ مِنَ الشَّيْطَانِالرَّجِيْمِ بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ ",
      "إِنَّافَتَحْنَالَكَ فَتْحًامُبِيْنًالَّيَغْفِرَلَكَ اللَّهُ مَاتَقَدَّمَ مِنْ ذَنْبِكَ وَمَاتَأَخَّرَوَيُتِمَّ نِعْمَتَهُ عَلَيْكَ وَيَهْدِيَكَ صِرَاطًامُسْتَقِيْمًاوَيَنْصُرُكَ اللّٰهُ نْصْرًاعَزِيْزًا",
      "ٌلَقَدْجَاءَكُمْ رَسُوْلٌ مَّنْ أَنْفُسِكُمْ عَزِيْزٌعَلَيْهِمَاعَنِتُمْ حَرِيْصٌ عَلَيْكُمْ بِالْمُؤْمِنِيْنَ رَؤُوْفٌ رَّحِيْمٌ فَإِنْ تَوَلَّوْافَقُلْ حَسْبِيَ اللَّهُ لَاإِلَهَ إِلَّاهُوَعَلَيْهِ تَوَكَّلْتُ وَهُوَرَبُّ الْعَرْشِ الْعَظِيْمِ",
      "إِنَّ اللَّهَ وَمَلَلآئِكَتَهُ يٌصَلٌّوْنَ عَلَ النَّبِيَّ يَاأَيُهَاالَّذِيْنَ آمَنُوْاصَلُّوْاعَلَيْهِ وَسَلَّمُوْاتَسْلِيْمًا",
      "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ وَعَلَی آلِهِ",

    ],
    audio: "audio/Inna_Fatahna_4.mp3"
    ),
    DataAdhiya(
    name: "Alhamdulillahi",
    verses: [
      "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ وَعَلَی آلِهِ",
      "صَلَّى اللّٰهُ عَلَيْهِ",
      "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ",
      "الْحَمْدُلِلَّهِ الَّزِيْ هَدَانَابِعَبْدِهِ الْمُخْتَارِمَنْ دَعَانَا",
      "صَلَّى اللّٰهُ عَلَيْهِ",
      "إِلَيْهِبِاْلإِذْنِ وَقَدْنَادَانَالَبَّيْكَ يَامَنْ دَلَّنَاوَحَدَانَا",
      "صَلَّى اللّٰهُ عَلَيْهِ",
      "صَلَّی عَلَيْكَ اللَّهُ بَا رِیُٔكَ الَّذِيْ بِكَ يَامُشَفَّعُ خَصَّنَاوَحَبَانَا",
      "صَلَّى اللّٰهُ عَلَيْهِ",
      "مَعَ آلِكَ الأَطْهَارِمَعْدِنِ سِرَّكَ اْلأَسْمَی فَهُمْ سُفُنُ النَّجَاۃِحِمَانَا",
      "صَلَّى اللّٰهُ عَلَيْهِ",
      "وَعَلَی صَحَابَتِكَ الْكِرَامِ حُمَاۃِدِيْنِكَ أَصْبَحُوْالِوَلَائِهِ عُنْوَانَا",
      "صَلَّى اللّٰهُ عَلَيْهِ",
      "وَالتَّابِعِيْنَ لَهُمْ بِصِدْقٍ مَاحَدَی حَادِي الْمَوَدَّۃِهَيَّجَ الْأَشْجَانَا",
      "صَلَّى اللّٰهُ عَلَيْهِ",
      "وَاللَّهِ مَازُكِرَالْحَبِيْبُ لَدَی لْمُحِبِّ إِلَّاوَأَضْحَی وَالِهًانَشْوَانَا",
      "صَلَّى اللّٰهُ عَلَيْهِ",
      "أَيْنَ الْمُحِبُّوْنَ الَّزِيْنَ عَلَيْهِمُ بَزْلُ النُّفُوْسِ مَعَ النَّفَائِسِ هَانَا",
      "صَلَّى اللّٰهُ عَلَيْهِ",
      "لاَيَسْمَعُوْنَ بِزِ كْرِطٰهَ الْمُصْطَفَی إِلاَّبِهِ انْتَعَشُوْاوَأَزْهَبَ رَانَا",
      "صَلَّى اللّٰهُ عَلَيْهِ",
      "فَاهْتَاجَتِ ا لأَرْوَاحُ تَشْتَاقُ اللِّقَاوَتَحِنُّ تَسْأَلُ رَبَّهَاالرِّا ضْوَانَا",
      "صَلَّى اللّٰهُ عَلَيْهِ",
      "حَالُ الْمُحِبِّيْنَ كَزَافَاسْمَعْ إِلَی سِيَرِ الْمُشَفَّعِ وَارْهِفِ الْآزَانَا",
      "صَلَّى اللّٰهُ عَلَيْهِ",
      "وَانْصِتْ إِلَی أَوْصَافِ طٰهَ الْمُجْتَبَی وَاحْضِرْلِقَلْبِكَ يِمْتَلِیءْوِجْدَانَا",
      "يَارَبَّنَاصَلِّ وَسَلِّمْ دَائِمًاعَلَی حَبِيْبِكَ مَنْ إِلَيْكَ دَعَانَا",
      "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ وَعَلَی آلِهِ",

    ],
    audio: "audio/alhamdulillahi_5.mp3"
    ),

    DataAdhiya(
    name: "Nabba Annallah",
    verses: [
      "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ وَعَلَی آلِهِ",
      "صَلَّى اللّٰهُ عَلَيْهِ",
      "وَالنُوْرُطَهَ عَبْدُهُ مَنَّ بِهِ فِی زِكْرِهِ أَعْظِمْ بِهِ مَنَّانَا",
      "هُوَرَحْمَةُالْمَوْلَی تَأَمَّلْ قَوْلَهُ فَلْيَفْرَحُوْاوَاغْدُبِهِ فَرْحَانَا",
      "مُسْتَمْسِكَابِالْعُرْوَۃِالْوُشْقَی وَمُعْتَصِمًابِحَبْلِ اللّٰهِ مَنْ أَنْشَانَا",
      "وَاسْتَشْعِرَنْ أَنْوَارُمَنْ قِيْلَ مَتَی كُنْتَ نَبِيًّاقَالَ آدَمُ كَانَا",
      "بَيْنَ التُّرَابِ وَبَيْنَ مَاءٍفَاسْتَفِقْ مِنْ غَفْلَةٍعَنُ زَاوَكُنْ يَقْظَانَا",
      "وَاعْبُرْإِلَی أَسْرَارِرَبَّيْ لَمْ يَزَلْ يَنْقُلُنِی بَيْنَ الْخِيَارِمُصَانَا",
      "لَمْ تَفْتَرِقْ مِنْ شُعْبَتَيْنِ إِلَّاأَنَافِيْ خَيْرِهَاحَتَّی بُرُوْزِيَ آنَا",
      "فَأَنَا خِيَا رٌمِنْ خِيَارٍ قَدْخَرَجْتُ مِنْ نِكَا حٍ لِيْ إِلٰهِيَ صَانَا",
      "طَهَّرَهُ اللّٰهُ حَمَاهُ اخْتَارَهُ وَمَابَرَی كَمِشْلِهِ إِنْسَانَا",
      "وَبِحُبِّهِ وَبِزِكْرِهِ وَالنَّصْرِوَالتَّوْقِيْرِرَبُّ الْعَرْشِ قَدْ أَوْصَانَا",
      "يَارَبَّنَاصَلِّ وَسَلِّمْ دَائِمًاعَلَی حَبِيْبِكَ مَنْ إِلَيْكَ دَعَانَا",
      "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ وَعَلَی آلِهِ",
    ],
    audio: "audio/Nabba_Anallah_6.mp3"
    ),

    DataAdhiya(
    name: "Nurul Musthofa",
    verses: [
      "حَبِيْبِ مُحَمّدْ",
      "مُحَمَّدْ مُحَمَّدْ",
      "حَيْرِالْمُرْسَلِيْنْ",
      "نُوْرُالْمُصطَفَی نُوْرُالْمُصْطَفَی",
      "مَلَأَالأَكْوَانْ مَلَأَالأَكْوَانْ",
      "حَبِيْبِيْ مُحَمَّدْ مُحَمَّدْمُحَمَّدْ خَيْرِالْمُرْسَلِيْنَ",
      "اللّٰهُ الْجَلاَلْ أَعْطَاكَ الْجَمَالْ",
      "يَاشَمْسَ الْكَمَالْ يَانُوْرَالْعَيْنِ",
      "حَبِيْبِيْ مُحَمَّدْ مُحَمَّدْمُحَمَّدْ خَيْرِالْمُرْسَلِيْنَ",
      "نُوْ رُكَ الْوَاضََحْ مَالِكُ الْأَرْوَاحْ",
      "كَمْ مُحِبَّ الرَّ حِيْلَ الْحَرَمَيْنَ",
      "حَبِيْبِيْ مُحَمَّدْ مُحَمَّدْمُحَمَّدْ خَيْرِالْمُرْسَلِيْنَ",
      "كَفَاكَ فَضْلاً فیِ الْعُلَی الْأَعْلَی",
      "دَنَافَتَدَلَّ قَابَ قَوْسَيْنِ",
      "حَبِيْبِيْ مُحَمَّدْ مُحَمَّدْمُحَمَّدْ خَيْرِالْمُرْسَلِيْنَ",
      "يَااللّٰهُ يَابَدِيعْ بَلَّغْنَا جَمِيعْ ",
      "حَضْرَ ۃَالشَفِيعْ خَيْرِالشَّقَلَينْ",
      "حَبِيْبِيْ مُحَمَّدْ مُحَمَّدْمُحَمَّدْ خَيْرِالْمُرْسَلِيْنَ",
      "يَاخَيْرَمُعْطِی أَوْصِلْ سَلاَتِيْ",
      "لِلسَّرَّالزَاتِ نُوْ رِالْكَوْ سَيْنِ",
      "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ وَعَلَی آلِهِ",

    ],
    audio: "audio/Nurul_Musthofa_7.mp3"
    ),

    DataAdhiya(
    name: "Hadza Waqod Nasaro",
    verses: [
      "هَذَاوَقَدْنَشَرَاْلإِلَهُ نُعُوْتَهُ فِي الْكُتْبِ بَيَّنَهَا لَنَاتِبْيَانَا ",
      "أَخَزَمِيْشَاقَ النَّبِيِّيْنَ لَمَاآتَيْتُكُمْ مِنْ حِكْمَةٍإِحْسَانَا",
      "وَجَاءَكُمْ رَسُوْلُنَا لَتُؤْ مِنُنَّ وَتَنْصُرُوْنَ وَتُصْبِحُوْنَ أَعْوَانَا",
      "قَدْبَشَّرُوْاأَقْوَامَهُمْ بِالْمُصْطَفَی أَعْظِمْ بِزَلِكَ رُتُبَةًوَمَكَانَا",
      "فَهُوَوَإِنْ جَاءَالْأَخِيْرُمُقَدَّمٌ يَمْشُوْنَ تَحْتَ لِوَاءِمَنْ نَادَانَا",
      "يَاأُمَّةَالْإِسْلَا مِ أَوَّلُ شَافِعِ وَمُشَفَّعِ أَنَاقَطُّ لَاأَتَوَانَی",
      "حَتَّی أُنَادَی ارْفَعْ وَسَلْ تُعْطَ وَقُلْ يُسْمَعْ لِقَوْلِكَ نَجْمُ فَخْرِكَ بَانَا",
      "وَلِوَاءُحَمْدِاللّٰهِ جَلَّ بِيَدِي وَلأَوَّلاَآتَيْ أَنَاالْجِنَانَا",
      "وَأَكْرَمُ ا لْخَلْقِ عَلَی اللّٰهِ أَنَافَلَقَدْحَبَاكَ اللّٰهُ مِنْهُ حَنَانَا",
      "وَلَسَوْ فَ يُعْطِيْكَ فَتَرْ ضَی جَلَّ مِنْ مُعْطٍ تَقَا صَرَعَنْ عَطَاهُ نُهَانَا",
      "بِاللّٰهِ كَرَ رْذِكْرَوَصْفِ مَحَمَّدٍ كَيْمَا تُزِيْحَ عَنِ الْقُلُوْ بِ الرَّانَا",
      "يَارَبَّنَا صَلِّ وَسَلِّمْ دَائِمًاعَلَی حَبِيْبِكَ مَنْ إِلَيْكَ دَعَانَا",
      "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ وَعَلَی آلِهِ",
    ],
    audio: "audio/Hadza_Waqod_Nasaro_8.mp3"
    ),

    DataAdhiya(
    name: "Khoirol Bariyyah",
    verses: [
      "خَيْرَ الْبَرِيَّةْ نَظْرَةْ إِلَيَّا * مَا أَنْتَ إِلاَّ كَنْزُ الْعَطِيَّةْ",
      "يَا بَحْرَ فَضْلِ وَتَاجَ عَدْلِ * جُدْلِ بِوَصْلٍ قَبْلَ الْمَنِيَّةْ",
      "حَاشَا كَ تَغْفُلْ عَنَّا وَتَبْخَلْ * يَا خَيْرَ مُرْسَلْ إِرْحَمْ شَجِيَّا",
      "كَمْ ذَا أُنَادِيْ يَا خَيْرَ هَادِي * يَكْفِى عِبَادِيْ يَا نُوْر عَيْنَيَّا",
      "صَلاَةُ رَبَّيْ عَلَيْكَ حِبَّيْ * مَادَامَ قَلْبِي بِذِكْرِ حَيَّا",
      "كَذَا سَلاَمِيْ عَلَى الدَّوَامِ * عِنْدَ الصَّلاَحِيْ مَعَ الأَتِيَّةٌ",
      "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ وَعَلَی آلِهِ",
    ],
    audio: "audio/Khoirol_Bariyah_9.mp3"
    ),

    DataAdhiya(
    name: "Lamma Dana",
    verses: [
      "لَمَّا دَنَا وَقْتُ الْبُرُوْزِ لِأَحْمَدٍ عَنْ إِذْنِ مَنْ مَاشَاءَهُ قَدْ كَانَا",
      "حَمَلَتْ بِهِ الْأَمِيْنَةُ بِيْتُ وَهْبٍٍ مَنْ لَهَاأَعْلَى الِْإلَهُ مَكَانَا",
      "مِنْ وَالِدِ الْمُخْتَارِ عَبْدِ اللّٰهِ بِنْ عَبْدٍ لِمُطَّلِبٍ رَأَى الْبُرْهَانَا",
      "قَدْ كَانَ يَغْمُرُ نُوْرُ طَهَ وَجْهَهُ وَسَرَى إِلَى الإِبْنِ الْمَصُوْنِ عَيَانَا",
      "وَهُوَ ابْنُ هَاشِمٍ الْكَرِيْمِ الشَّهْمِ بْنِ عَبْدِ مَنَافِ ابْنِ قُصَيَّ كَانَا",
      "وَالِدُهُ يُدْعَى حَكِيْمًا شَأْنُهُ قَدِ اعْتَلَى أَعْزِزْ بِذَالِكَ شَانَا",
      "وَاحْفَظْ أُصُوْلَ الْمُصْطَفَى حَتَّى تَرَى فِی سِلْسِلاَتِ أُصُوْلِهِ عَدْنَانَا",
      "فَهُنَاكَ قِفْ وَاعْلَمْ بِرَفْعِهِ إِلَى السْمَا عِيْلَ كَانَ لِلأَبِ مِعْوَانَا",
      "وِحِيْنَمَا حَمَلَتْ بِهِ آمِنَةٌ لَمْ تَشْكُ شَيْئًا يَأخُذُ النَّسْوَانَا",
      "وَبِهَاأَحَاطَ اللُّطْفُ مِنْ رَبَّ السَّمَا أَقْصَى الأَذَى وَالْهَمَّ وَالْأَحْزَانَا",
      "وَرَأَتْ كَمَا قَدْ جَاءَ مَا عِلْمَتْ بِهِ أَنَّ الْمُهَيْمِنَ شَرَّفَ الَْأكْوَانَا",
      "بِالطُّهْرِ مَنْ فیِ بَطْنِهَا فَاسْتَبْشَرَتْ وَدَنَاالْمَخَاضُ فَأُتْرِعَتْ رِضْوَانَا",
      "وَتَجَلَّتْ الَْأنْوَارُ مِنْ كُلَّ الْجِهَا تِ فَوَقْتُ مِيْلاَدِالْمُشَفَّعِ حَانَا",
      "وَقُبَيْلَ فَجْرٍ أَبْرَزَتْ شَمْسَ الْهُدَى ظَهَرَ الْحَبِيْبُ مُكَرَّمًاوَمُصَانَا",
    ],
    audio: "audio/Lamma_Dana_10.mp3"
    ),

    DataAdhiya(
    name: "Mahallul Qiyam",
    verses: [
      "صَلَّى اللّٰهُ عَلَى مُحَمَّدْ صَلَّى اللّٰهُ عَلَيْهِ وَسَلَّمْ",
      "يَانَبِيْ سَلاَمْ عَلَيْكَ  يَارَسُولْ سَلاَمْ عَلَيْكَ",
      "يَاحَبِيبْ سَلَامُ عَلَيْكَ  صَلَوَاتُ اللّٰه عَلَيْكَ",
      "أَبْرَزَاللّٰهُ الْمُشَفَّعْ  صَاحِبَ الْقَدْرِالْمُرَفَّعْ",
      "فَمَلَا نُّوْرُالنَّوَاحِيْ  عَمَّ كُلَّ الْكَوْنِ أَجْمَعْ",
      "نُكِسَتْ أَصْنَامُ شِرْكٍ  وَبِنَاالشِّرْكِ تَصَدَّعْ",
      "وَدَنَاوَقْتُ الْهِدَايَةْ  وَحِمَى الْكُفْرِ تَزَعْزَعْ",
      "مَرْحَبًاأَهْلًاوَسَهْلًا  بِكَ يَاذَالْقَدْرِالَْأرْفَعْ",
      "يَاإِمَامَ اهْلِ الرِّسَالَةْ  مَنْ بِهِ الْآفَاتُ تُدْفَعْ",
      "أَنْتَ فِي الْحَشْرِ مَلَاذٌ  لَكَ كُلُّ الْخَلْقِ تَفْزَعْ",
      "وَيُنَادُوْنَ تَرَى مَا  قَدْدَهَامِنْ هَوْلٍ أَفْظَعْ",
      "مَرْحَبًايَانُوْرَالعَيْنِ مَرْحَبًا  مَرْحَبًاجَدَّالْحُسَيْنِ مَرْحَبًا",
      "فَلَهَاأَنْتَ فَتَسْجُدْ  وَتُنَادَى اشْفَعْ تُشَفَّعْ",
      "فَعَلَيْكَ اللّٰهُ صَلَّى  مَابَدَى النَّوْرُوَشَعْشَعْ",
      "وَبِكَ الرَّحْمَنُ نَسْأَلْ  وَإِلَهُ الْعَرْشِ يَسْمَعْ",
      "َرَبِّ فَاغْفِرْلِيْ ذُنُوْبِيْ يَااَللّٰه   بِبَرْكَةَالْهَادِى الْمُشَفَّعْ يَااللّٰه",
      "يَاعَظِيْمَ الْمَنِّ يَارَبْ  شَمْلَنَابِالْمُصْطَفَى اجْمَعْ",
      "وَبِهِ فَانْظَرْإِلَيْنَا  وَاعْطِنَابِهِ كُلَّ مَطْمَعْ",
      "وَاكْفِنَاكُلَّ الْبَلَايَا  وَادْفَعْ الْآفَاتِ وَرْفَعْ",
      "صَلَّى اللهُ عَلَى مُحَمَّدْ  صَلَّى اللهُ عَلَيْهِ وَسَلَّمْ",
      "وَاسْقِنَايَارَبْ أَغِثْنَا  بِحَيَّاهَطَالِ يَهْمَعْ",
      "وَخْتِمِ الْعُمْرَبِحُسْنَى  وَحْسِنِ الْعُقْبَى وَمَرْجَعْ",
      "وَصَلَاةُاللّٰهِ تَغْشَى  مَنْ لَهُ الْحُسْنُ تَجَمَّعْ",
      "أَحْمَدَالطَّهْرَوَآلِهِ  وَالصَّحَابَةمَاالسَّنَاشَعْ",
      "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَيْهِ وَعَلَی آلِهِ",

    ],
    audio: "audio/Mahalul_Qiyam_11.mp3"
    ),
    DataAdhiya(
    name: "Doa",
    verses: [
      "ولَقَدْأَشَرْتُ لِنَعْتِ مَنْ أَوْصَافُهُ  تُحْيِي الْقُلُوْبَ تُهَيِّجُ الْأَشْجَانَا",
      "وَاللهُ قَدْأَثْنَى عَلَيْهِ فَمَايُسَا  وِى الْقَوْلُ مِنَّاأَوْيَكُوْنُ ثَنَانَا",
      "لَكِنْ حُبًّافِي السَّرَائِرِقَدْدَعَا  لِمَدِيْحِ صَفْوَةِرَبِّنَاوَحَدَانَا",
      "وَإِذِامْتَزَجْنَابِالْمَوَدَّةِهَهُنَا  نَرْفَعُ أَيْدِيْ فَقْرِنَاوَرَجَانَا",
      "لِلْوَاحِدِالْأَحَدِالْعَلِيِّ إِلَهَنَا  مُتَوَسِّلِيْنَ بِمَنْ إِلَيْهِ دَعَانَا",
      "مُخْتَارِهِ وَحَبِيْبِهِ وَصَفِيِّهِ  زَيْنَ الْوُجُوْدِ بِهِ الْإِلَهُ حَبَانَا",
      "يَارَبَّنَايَارَبَّنَايَارَبَّنَا  الْمُصْطَفَى أَقْبَلْنَاأَجِبْ دَعْوَانَا",
      "أَنْتَ لَنَاأَنْتَ لَنَايَادَخْرَنَا  فِي هَذِهِ الدُّنْيَاوَفِي أُخْرَانَا",
      "أَصْلِحْ لَنَاالْأَحْوَالَ وَاغْفِرْ ذَنْبَنَا  وَلاَ تُؤَاخِذْرَبِّي إِنْ أَخْطَانَا",
      "وَاسْلُكْ بِنَافِي نَهْجِ طَهَ الْمُصْطَفَى  ثَبِّتْ عَلَى قَدَمِ الْحَبِيْبِ خُطَانَا",
      "أَرِنَابِفَضْلٍ مِنْكَ طَلْعَةَأَحْمَدٍ  فِي بَهْجَةٍعَيْنَ الرِّضَاتَرْعَانَا",
      "وَارْبُطْ بِهِ فِي كُلِّ حَالٍ حَبْلَنَا  وَحِبَالَ مَنْ وَدَّوَمَنْ وَالْأَنَا",
      "وَالْمُحْسِنِيْنَ وَمَنْ أَجَابَ نِدَائَنَا  وَذَوِي الْحُقُوْقِ وَطَالِبًاأَوْصَانَا",
      "وَالْحَاضِرِيْنَ وَسَاعِيًافِي جَمْعِنَا  هَانَحْنُ بَيْنَ يَدَيْكَ أَنْتَ تَرَانَا",
      "وَلَقَدْرَجَوْنَاكَ فَحَقِّقْ سُؤْلَنَا  وَاسْمَعْ بِفَضْلِكَ يَاسَامِيْعُ دُعَانَا",
      "وَانْصُرْبِنَاسُنَّةَطَهَ فِي بِقَا  عِ الْأَرْضِ وَاقْمَعْ كُلَّ مَنْ عَادَانَا",
      "وَانْظُرْإِلَيْكَ وَاسْقِنَاكَأْسَ الْهَنَا  وَاشْفِ وَعَافِ عَاجِلًامَرْضَانَا",
      "وَاقْضِ لَنَاالْحَاجَاتِ وَاحْسِنْ خَتْمَنَا  عِنْدَالْمَمَاَتِ وَأَصْلِحَنْ عُقْبَانَا",
      "يَارَبِّ وَاجْمَعْنَاوَأَحْبَابًالَنَا  فِي دَارِكَ الْفِرْدَوْسِ يَارَجْوَانَا",
      "بِالْمُصْطَفَى صَلِّ عَلَيْهِ وَآلِهِ  مَاحَرَّكَتْ رِيْحُ الصَّبَااغْصَانَا",
      "سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُوْنَ  وَسَلَامٌ عَلَى الْمُرْسَلِيْنَ  وَالْحَمْدُلِلهِ  رَبِّ الْعَالَمِيْنَ",

    ],
    audio: "audio/Doa_12.mp3"
    ),
  
];
